

greetingMessage = 'Добро пожаловать! Данный бот предназначен для контроля своего питания.'
default = 'Установлены средние параметры тела!'
stat_info = 'Ваш вес: {}\nВаш рост: {}\nПроцент жира: {}\nВаша программа: {}\n\nСъедено за сегодня: {} // {} ккал\nБелков: {} // {}\nЖиров: {} // {}\nУглеводов: {} // {}'
product_text = 'Наименование: {}\nКкал: {}\nБелки: {}\nЖиры: {}\nУглеводы: {}'


enter_ate_count = "Введите съеденное количество в граммах"

found_several = "В базе найдено несколько совпадений, выберите Ваш продукт"

no_product_write = "Продукта не нашлось в БД. Желаете записать в базу?"

accepted = "Принято!"

type_num = "Необходимо писать цифрой, без пробелов!"

wait_whey = "Принято! Теперь напишите цифрой кол-во белков на 100гр"

wait_fat = "Принято! Теперь напишите цифрой кол-во жиров на 100гр"

wait_carboh = "Принято! Теперь напишите цифрой кол-во углеводов на 100гр"

wait_count = "Принято! Теперь напишите цифрой кол-во съеденного продукта:"

product_wrtten_ate = "Записано"

set_body_weight = "Записано"

set_body_long = "Записано"

set_body_fat = "Записано"

expect_0_50 = "Ожидается число от 0 до 50"

not_in_db = "Вас нету в базе, обратитесь к @lorrodx"

wait_product_name = 'Напишите название продукта'

wait_body_weight = 'Отправьте ваш вес цифрой'

wait_body_long = 'Отправьте ваш рост цифрой'

wait_body_fat = 'Оцени свой % подкожного жира и напиши цифрой от 0-50'

choose_main_prog = 'Выберите программу!'

wait_subprog = 'Пожалуйста выберите программу в зависимости от интенсивности физ. нагрузок'

set_subprog = "Программа '{}' установлена"

bug_fix = 'Нажми /clear - не реализовано'

wait_kkal = 'Вам предстоит ввести информацию о продукте на 100 гр.\nВведите цифрой количество ккал.'

canceled_new_prod = 'Добавление продукта отменено.'

canceled_in_prog = 'Отменено!(во время создания)'

wait_eaten_count = "Введите съеденное количество в граммах"

wait_float = "Необходимо писать цифрой, без пробелов! (Для указания не целого числа используйте точку, пример - '3.5')"
